# =========1.1数字类型
# int
# float 浮点型
# complex 复数 a+bj
# =========1.2 字符串类型
# =========1.3 布尔类型

# =================2。组合类型：列表、元组、字典、集合
# ==== 2。1 列表  序列类型：数据有位置顺序
# 表示方式[1,1, 2]
# a =[1, 2, 3, 4]
# print(a[0])
# ==== 2。2 tuple元组 序列类型 表示方式（data1，data2）
# 元素不支持修改---"不可变的列表"
# ==== 2。3 字典
# student = { 201901:"小明", 201902:"小红"}
# print(student[201901])
# ==== 2。3 字典
# set集合 一系列互不相等元素的集合，无序的
# 表示方式：{data1,data2}
# print({"xiaoming","xiaoming","xiaohong"})

# -----------第二部分 变量
# =====1。变量的概念
# =====2。变量的命名
# =====3。打包赋值
# x, y = 1, 2
# print(x, y)
# x, y = y, x # 可直接交换
# print(x, y)

# -----------第三部分 控制流程
# 1。顺序流程
# 2。循环流程 ------遍历循环（for）
# res = 0
# for i in [1, 2, 3, 4, 5]:
#     res += i
# print(res)
# 3。循环流程 ------无限循环（while）
# i = 1
# res = 0
# while i<=5:
#     res += i
#     i += 1
# print(res)
# 4。分支流程（if)
# age = 18
# if age > 18:
#     print("OK")
# else:
#     print("NO")
# -----------第四部分 输入输出
# x = input("请输入一个数字：")
# print(x)  #类型是字符串

# x = eval(input("请输入一个数字："))
x = input("请输入一个数字：")
print(x)  #类型是字符串3

print(type(x))

